*** src/aes.rs:118:9: replace AesGcmEncryptor::key_bytes -> &[u8; 32] with Box::leak(Box::new([0; 32]))

*** mutation diff:
--- src/aes.rs
+++ replace AesGcmEncryptor::key_bytes -> &[u8; 32] with Box::leak(Box::new([0; 32]))
@@ -110,17 +110,17 @@
             .map_err(|e| AesError::Decrypt(e.to_string()))
     }
 
     /// Returns a reference to the raw key bytes.
     ///
     /// # Requirements
     /// REQ-CK-107
     pub fn key_bytes(&self) -> &[u8; 32] {
-        &self.key
+        Box::leak(Box::new([0; 32])) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // Tests exercise failure paths and invariants directly; unwrap/expect,
 // slicing, and panicking asserts are acceptable here — violations
 // surface as test failures, not production panics.
 #[allow(
     clippy::unwrap_used,

---- aes::tests::key_bytes_round_trip stdout ----

thread 'aes::tests::key_bytes_round_trip' (3273678) panicked at src/aes.rs:197:9:
assertion `left == right` failed
  left: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [188, 43, 48, 101, 21, 61, 1, 17, 69, 133, 126, 40, 93, 5, 57, 21, 75, 2, 92, 31, 154, 123, 133, 166, 119, 74, 248, 79, 199, 165, 235, 50]

failures:
    aes::tests::key_bytes_round_trip

test result: FAILED. 25 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.14s

*** result: Failure(101)
