*** src/aes.rs:118:9: replace AesGcmEncryptor::key_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))

*** mutation diff:
--- src/aes.rs
+++ replace AesGcmEncryptor::key_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))
@@ -110,17 +110,17 @@
             .map_err(|e| AesError::Decrypt(e.to_string()))
     }
 
     /// Returns a reference to the raw key bytes.
     ///
     /// # Requirements
     /// REQ-CK-107
     pub fn key_bytes(&self) -> &[u8; 32] {
-        &self.key
+        Box::leak(Box::new([1; 32])) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // Tests exercise failure paths and invariants directly; unwrap/expect,
 // slicing, and panicking asserts are acceptable here — violations
 // surface as test failures, not production panics.
 #[allow(
     clippy::unwrap_used,

---- aes::tests::key_bytes_round_trip stdout ----

thread 'aes::tests::key_bytes_round_trip' (3274154) panicked at src/aes.rs:197:9:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [226, 34, 14, 174, 93, 149, 65, 38, 196, 24, 196, 198, 91, 169, 55, 15, 45, 246, 210, 108, 204, 230, 206, 132, 245, 80, 242, 157, 17, 93, 150, 212]

failures:
    aes::tests::key_bytes_round_trip

test result: FAILED. 25 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.14s

*** result: Failure(101)
