*** src/aes.rs:76:9: replace AesGcmEncryptor::encrypt -> Result<Vec<u8>, AesError> with Ok(vec![0])

*** mutation diff:
--- src/aes.rs
+++ replace AesGcmEncryptor::encrypt -> Result<Vec<u8>, AesError> with Ok(vec![0])
@@ -68,31 +68,17 @@
     /// Encrypts plaintext. Returns `nonce || ciphertext`.
     ///
     /// The first 12 bytes are the nonce, the rest is the AES-GCM ciphertext
     /// including the 16-byte authentication tag.
     ///
     /// # Requirements
     /// REQ-CK-002
     pub fn encrypt(&self, plaintext: &[u8]) -> Result<Vec<u8>, AesError> {
-        let cipher =
-            Aes256Gcm::new_from_slice(&self.key).map_err(|e| AesError::Encrypt(e.to_string()))?;
-
-        let mut nonce_bytes = [0u8; 12];
-        random::secure_random_bytes(&mut nonce_bytes);
-        let nonce = Nonce::from_slice(&nonce_bytes);
-
-        let ciphertext = cipher
-            .encrypt(nonce, plaintext)
-            .map_err(|e| AesError::Encrypt(e.to_string()))?;
-
-        let mut output = Vec::with_capacity(12 + ciphertext.len());
-        output.extend_from_slice(&nonce_bytes);
-        output.extend_from_slice(&ciphertext);
-        Ok(output)
+        Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Decrypts `nonce || ciphertext` produced by [`encrypt`](Self::encrypt).
     ///
     /// # Requirements
     /// REQ-CK-002, REQ-CK-102, REQ-CK-103, REQ-CK-200
     pub fn decrypt(&self, data: &[u8]) -> Result<Vec<u8>, AesError> {
         if data.len() < 12 {

---- aes::tests::empty_plaintext stdout ----

thread 'aes::tests::empty_plaintext' (3265193) panicked at src/aes.rs:152:50:
called `Result::unwrap()` on an `Err` value: Decrypt("data too short")

---- aes::tests::round_trip stdout ----

thread 'aes::tests::round_trip' (3265196) panicked at src/aes.rs:126:50:
called `Result::unwrap()` on an `Err` value: Decrypt("data too short")

---- aes::tests::shared_handle_concurrent_roundtrip stdout ----

thread '<unnamed>' (3265198) panicked at src/aes.rs:200:43:
called `Result::unwrap()` on an `Err` value: Decrypt("data too short")

thread '<unnamed>' (3265203) panicked at src/aes.rs:200:43:
called `Result::unwrap()` on an `Err` value: Decrypt("data too short")

thread '<unnamed>' (3265204) panicked at src/aes.rs:200:43:
called `Result::unwrap()` on an `Err` value: Decrypt("data too short")

thread '<unnamed>' (3265202) panicked at src/aes.rs:200:43:
called `Result::unwrap()` on an `Err` value: Decrypt("data too short")

failures:
    aes::tests::empty_plaintext
    aes::tests::round_trip
    aes::tests::shared_handle_concurrent_roundtrip
    proptests::aes_gcm_roundtrip

test result: FAILED. 22 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.18s

*** result: Failure(101)
