*** src/aes.rs:98:23: replace < with == in AesGcmEncryptor::decrypt

*** mutation diff:
--- src/aes.rs
+++ replace < with == in AesGcmEncryptor::decrypt
@@ -90,17 +90,17 @@
         Ok(output)
     }
 
     /// Decrypts `nonce || ciphertext` produced by [`encrypt`](Self::encrypt).
     ///
     /// # Requirements
     /// REQ-CK-002, REQ-CK-102, REQ-CK-103, REQ-CK-200
     pub fn decrypt(&self, data: &[u8]) -> Result<Vec<u8>, AesError> {
-        if data.len() < 12 {
+        if data.len() == /* ~ changed by cargo-mutants ~ */ 12 {
             return Err(AesError::Decrypt("data too short".into()));
         }
 
         let (nonce_bytes, ciphertext) = data.split_at(12);
         let nonce = Nonce::from_slice(nonce_bytes);
 
         let cipher =
             Aes256Gcm::new_from_slice(&self.key).map_err(|e| AesError::Decrypt(e.to_string()))?;

---- aes::tests::decrypt_rejects_truncated_input stdout ----

thread 'aes::tests::decrypt_rejects_truncated_input' (3271892) panicked at src/aes.rs:102:46:
mid > len

failures:
    aes::tests::decrypt_rejects_truncated_input

test result: FAILED. 25 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.31s

*** result: Failure(101)
