*** src/aes.rs:98:9: replace AesGcmEncryptor::decrypt -> Result<Vec<u8>, AesError> with Ok(vec![0])

*** mutation diff:
--- src/aes.rs
+++ replace AesGcmEncryptor::decrypt -> Result<Vec<u8>, AesError> with Ok(vec![0])
@@ -90,29 +90,17 @@
         Ok(output)
     }
 
     /// Decrypts `nonce || ciphertext` produced by [`encrypt`](Self::encrypt).
     ///
     /// # Requirements
     /// REQ-CK-002, REQ-CK-102, REQ-CK-103, REQ-CK-200
     pub fn decrypt(&self, data: &[u8]) -> Result<Vec<u8>, AesError> {
-        if data.len() < 12 {
-            return Err(AesError::Decrypt("data too short".into()));
-        }
-
-        let (nonce_bytes, ciphertext) = data.split_at(12);
-        let nonce = Nonce::from_slice(nonce_bytes);
-
-        let cipher =
-            Aes256Gcm::new_from_slice(&self.key).map_err(|e| AesError::Decrypt(e.to_string()))?;
-
-        cipher
-            .decrypt(nonce, ciphertext)
-            .map_err(|e| AesError::Decrypt(e.to_string()))
+        Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the raw key bytes.
     ///
     /// # Requirements
     /// REQ-CK-107
     pub fn key_bytes(&self) -> &[u8; 32] {
         &self.key

---- aes::tests::decrypt_rejects_truncated_input stdout ----

thread 'aes::tests::decrypt_rejects_truncated_input' (3270718) panicked at src/aes.rs:174:13:
length 0 must be Err

---- aes::tests::empty_plaintext stdout ----

thread 'aes::tests::empty_plaintext' (3270719) panicked at src/aes.rs:155:9:
assertion `left == right` failed
  left: [0]
 right: []

---- aes::tests::round_trip stdout ----

thread 'aes::tests::round_trip' (3270722) panicked at src/aes.rs:129:9:
assertion `left == right` failed
  left: [0]
 right: [104, 101, 108, 108, 111, 32, 119, 111, 114, 108, 100, 44, 32, 116, 104, 105, 115, 32, 105, 115, 32, 97, 32, 116, 101, 115, 116, 32, 109, 101, 115, 115, 97, 103, 101, 33]

failures:
    aes::tests::decrypt_rejects_truncated_input
    aes::tests::empty_plaintext
    aes::tests::round_trip
    aes::tests::shared_handle_concurrent_roundtrip
    aes::tests::tampered_ciphertext_fails
    aes::tests::wrong_key_fails
    proptests::aes_gcm_roundtrip
    proptests::aes_gcm_wrong_key_fails

test result: FAILED. 18 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.62s

*** result: Failure(101)
