*** src/aes.rs:98:9: replace AesGcmEncryptor::decrypt -> Result<Vec<u8>, AesError> with Ok(vec![1])

*** mutation diff:
--- src/aes.rs
+++ replace AesGcmEncryptor::decrypt -> Result<Vec<u8>, AesError> with Ok(vec![1])
@@ -90,29 +90,17 @@
         Ok(output)
     }
 
     /// Decrypts `nonce || ciphertext` produced by [`encrypt`](Self::encrypt).
     ///
     /// # Requirements
     /// REQ-CK-002, REQ-CK-102, REQ-CK-103, REQ-CK-200
     pub fn decrypt(&self, data: &[u8]) -> Result<Vec<u8>, AesError> {
-        if data.len() < 12 {
-            return Err(AesError::Decrypt("data too short".into()));
-        }
-
-        let (nonce_bytes, ciphertext) = data.split_at(12);
-        let nonce = Nonce::from_slice(nonce_bytes);
-
-        let cipher =
-            Aes256Gcm::new_from_slice(&self.key).map_err(|e| AesError::Decrypt(e.to_string()))?;
-
-        cipher
-            .decrypt(nonce, ciphertext)
-            .map_err(|e| AesError::Decrypt(e.to_string()))
+        Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the raw key bytes.
     ///
     /// # Requirements
     /// REQ-CK-107
     pub fn key_bytes(&self) -> &[u8; 32] {
         &self.key

---- aes::tests::empty_plaintext stdout ----

thread 'aes::tests::empty_plaintext' (3271229) panicked at src/aes.rs:155:9:
assertion `left == right` failed
  left: [1]
 right: []

---- aes::tests::tampered_ciphertext_fails stdout ----

thread 'aes::tests::tampered_ciphertext_fails' (3271234) panicked at src/aes.rs:147:9:
assertion failed: enc.decrypt(&ciphertext).is_err()

---- aes::tests::wrong_key_fails stdout ----

thread 'aes::tests::wrong_key_fails' (3271235) panicked at src/aes.rs:137:9:
assertion failed: enc2.decrypt(&ciphertext).is_err()

failures:
    aes::tests::decrypt_rejects_truncated_input
    aes::tests::empty_plaintext
    aes::tests::round_trip
    aes::tests::shared_handle_concurrent_roundtrip
    aes::tests::tampered_ciphertext_fails
    aes::tests::wrong_key_fails
    proptests::aes_gcm_roundtrip
    proptests::aes_gcm_wrong_key_fails

test result: FAILED. 18 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
